let arr = [{
  "song_id": 6,
  "lynic": "[ar:周杰伦]\r\r\n[ti:七里香]\r\r\n[00:00.11]周杰伦 - 七里香\r\r\n[00:00.82]作词：方文山\r\r\n[00:01.02]作曲：周杰伦\r\r\n[00:29.92]窗外的麻雀\r\r\n[00:33.25]在电线杆上多嘴\r\r\n[00:36.73]你说这一句\r\r\n[00:40.05]很有夏天的感觉\r\r\n[00:43.33]手中的铅笔\r\r\n[00:46.61]在纸上来来回回\r\r\n[00:49.69]我用几行字\r\r\n[00:51.76]形容你是我的谁\r\r\n[00:56.40]秋刀鱼的滋味\r\r\n[00:59.68]猫跟你都想了解\r\r\n[01:03.72]初恋的香味\r\r\n[01:05.59]就这样被我们寻回\r\r\n[01:09.88]那温暖的阳光\r\r\n[01:12.90]像刚摘的鲜艳草莓\r\r\n[01:16.33]你说你舍不得\r\r\n[01:18.75]吃掉这一种感觉\r\r\n[01:23.03]雨下整夜\r\r\n[01:25.51]我的爱溢出就像雨水\r\r\n[01:29.85]院子落叶\r\r\n[01:32.27]跟我的思念厚厚一叠\r\r\n[01:36.57]几句是非\r\r\n[01:39.00]也无法将我的热情冷却\r\r\n[01:44.09]你出现在我诗的每一页\r\r\n[01:50.19]雨下整夜\r\r\n[01:52.55]我的爱溢出就像雨水\r\r\n[01:56.79]窗台蝴蝶\r\r\n[01:59.22]像诗里纷飞的美丽章节\r\r\n[02:03.47]我接着写\r\r\n[02:05.99]把永远爱你写进诗的结尾\r\r\n[02:11.09]你是我唯一想要的了解\r\r\n[02:44.39]雨下整夜\r\r\n[02:46.51]我的爱溢出就像雨水\r\r\n[02:50.70]院子落叶\r\r\n[02:53.27]跟我的思念厚厚一叠\r\r\n[02:57.46]几句是非\r\r\n[03:00.03]也无法将我的热情冷却\r\r\n[03:05.02]你出现在我诗的每一页\r\r\n[03:11.52]那饱满的稻穗\r\r\n[03:14.75]幸福了这个季节\r\r\n[03:18.85]而你的脸颊\r\r\n[03:20.62]像田里熟透的蕃茄\r\r\n[03:24.96]你突然对我说\r\r\n[03:27.94]七里香的名字很美\r\r\n[03:31.37]我此刻却只想\r\r\n[03:33.79]亲吻你倔强的嘴\r\r\n[03:38.23]雨下整夜\r\r\n[03:40.60]我的爱溢出就像雨水\r\r\n[03:44.69]院子落叶\r\r\n[03:47.26]跟我的思念厚厚一叠\r\r\n[03:51.65]几句是非\r\r\n[03:54.01]也无法将我的热情冷却\r\r\n[03:59.05]你出现在我诗的每一页\r\r\n[04:05.61]整夜\r\r\n[04:07.67]我的爱溢出就像雨水\r\r\n[04:11.76]窗台蝴蝶\r\r\n[04:14.38]像诗里纷飞的美丽章节\r\r\n[04:18.82]我接着写\r\r\n[04:21.05]把永远爱你写进诗的结尾\r\r\n[04:26.15]你是我唯一想要的了解\r\r\n",
  "singer_id": 1,
  "sname": "七里香",
  "duration": "04:59",
  "url": "/media/周杰伦 - .七里香_20190720_154109.83b2a0b8.mp3",
  "index_show": 1,
  "singerName": "周杰伦",
  "area": "china",
  "id": 2,
  "album_name": "七里香",
  "album_art": "/img/5fdf8db1cb13495400f54ec2524e9258d0094aa8.37181773.jpg"
}, {
  "song_id": 13,
  "lynic": "[ar:周杰伦]\r\r\n[ti:发如雪]\r\r\n[00:00.08]周杰伦 - 发如雪\r\r\n[00:01.94]作词：方文山\r\r\n[00:03.57]作曲：周杰伦\r\r\n[00:21.51]狼牙月伊人憔悴\r\r\n[00:25.48]我举杯饮尽了风雪\r\r\n[00:31.56]是谁打翻前世柜\r\r\n[00:35.66]惹尘埃是非\r\r\n[00:37.84]缘字诀几番轮回\r\r\n[00:42.05]你锁眉哭红颜唤不回\r\r\n[00:48.13]纵然青史已经成灰\r\r\n[00:52.37]我爱不灭\r\r\n[00:55.80]繁华如三千东流水\r\r\n[00:59.60]我只取一瓢爱了解\r\r\n[01:03.80]只恋你化身的蝶\r\r\n[01:09.41]你发如雪凄美了离别\r\r\n[01:14.02]我焚香感动了谁\r\r\n[01:18.72]邀明月让回忆皎洁\r\r\n[01:22.82]爱在月光下完美\r\r\n[01:25.97]你发如雪纷飞了眼泪\r\r\n[01:30.52]我等待苍老了谁\r\r\n[01:35.18]红尘醉微醺的岁月\r\r\n[01:39.76]我用无悔刻永世爱你的碑\r\r\n[01:44.79]你发如雪凄美了离别\r\r\n[01:46.42]我焚香感动了谁\r\r\n[01:48.29]邀明月让回忆皎洁\r\r\n[01:50.66]爱在月光下完美\r\r\n[01:52.62]你发如雪纷飞了眼泪\r\r\n[01:54.69]我等待苍老了谁\r\r\n[01:56.57]红尘醉微醺的岁月\r\r\n[02:00.42]狼牙月伊人憔悴\r\r\n[02:04.87]我举杯饮尽了风雪\r\r\n[02:10.83]是谁打翻前世柜\r\r\n[02:14.53]惹尘埃是非\r\r\n[02:17.26]缘字诀几番轮回\r\r\n[02:21.41]你锁眉哭红颜唤不回\r\r\n[02:27.38]纵然青史已经成灰\r\r\n[02:31.58]我爱不灭\r\r\n[02:34.93]繁华如三千东流水\r\r\n[02:38.85]我只取一瓢爱了解\r\r\n[02:42.96]只恋你化身的蝶\r\r\n[02:48.71]你发如雪凄美了离别\r\r\n[02:53.31]我焚香感动了谁\r\r\n[02:58.09]邀明月让回忆皎洁\r\r\n[03:02.09]爱在月光下完美\r\r\n[03:05.28]你发如雪纷飞了眼泪\r\r\n[03:09.82]我等待苍老了谁\r\r\n[03:14.50]红尘醉微醺的岁月\r\r\n[03:19.06]我用无悔刻永世爱你的碑\r\r\n[03:24.06]你发如雪凄美了离别\r\r\n[03:25.78]我焚香感动了谁\r\r\n[03:27.59]邀明月让回忆皎洁\r\r\n[03:30.02]爱在月光下完美\r\r\n[03:31.71]你发如雪纷飞了眼泪\r\r\n[03:34.09]我等待苍老了谁\r\r\n[03:36.07]红尘醉微醺的岁月\r\r\n[03:38.76]你发如雪凄美了离别\r\r\n[03:42.91]我焚香感动了谁\r\r\n[03:47.56]邀明月让回忆皎洁\r\r\n[03:51.87]爱在月光下完美\r\r\n[03:54.86]你发如雪纷飞了眼泪\r\r\n[03:59.48]我等待苍老了谁\r\r\n[04:04.16]红尘醉微醺的岁月\r\r\n[04:08.68]我用无悔刻永世爱你的碑\r\r\n[04:22.43]铜镜映无邪扎马尾\r\r\n[04:25.53]你若撒野今生我把酒奉陪\r\r\n[04:38.58]铜镜映无邪扎马尾\r\r\n[04:41.99]你若撒野今生我把酒奉陪\r\r\n",
  "singer_id": 1,
  "sname": "发如雪",
  "duration": "05:01",
  "url": "/media/周杰伦 - .发如雪.88211eba.mp3",
  "index_show": 1,
  "singerName": "周杰伦",
  "area": "china",
  "id": 4,
  "album_name": "十一月的肖邦",
  "album_art": "/img/600x600bb.954daa12.jpg"
}, {
  "song_id": 8,
  "lynic": "[ar:周杰伦]\r\r\n[ti:东风破]\r\r\n[00:01.02]周杰伦 - 东风破\r\r\n[00:03.12]作词：方文山\r\r\n[00:04.86]作曲：周杰伦\r\r\n[00:06.89]编曲：林迈可\r\r\n[00:14.20]一盏离愁孤灯伫立在窗口\r\r\n[00:20.75]我在门后假装你人还没走\r\r\n[00:27.21]旧地如重游月圆更寂寞\r\r\n[00:33.87]夜半清醒的烛火不忍苛责我\r\r\n[00:40.40]一壶漂泊浪迹天涯难入喉\r\r\n[00:46.94]你走之后酒暖回忆思念瘦\r\r\n[00:53.50]水向东流时间怎么偷\r\r\n[01:00.15]花开就一次成熟我却错过\r\r\n[01:10.10]谁在用琵琶弹奏一曲东风破\r\r\n[01:16.64]岁月在墙上剥落看见小时候\r\r\n[01:23.09]犹记得那年我们都还很年幼\r\r\n[01:29.71]而如今琴声幽幽我的等候你没听过\r\r\n[01:36.38]谁在用琵琶弹奏一曲东风破\r\r\n[01:42.84]枫叶将故事染色结局我看透\r\r\n[01:49.46]篱笆外的古道我牵着你走过\r\r\n[01:56.07]荒烟蔓草的年头就连分手都很沉默\r\r\n[02:29.02]一壶漂泊浪迹天涯难入喉\r\r\n[02:35.46]你走之后酒暖回忆思念瘦\r\r\n[02:42.09]水向东流时间怎么偷\r\r\n[02:48.69]花开就一次成熟我却错过\r\r\n[02:58.54]谁在用琵琶弹奏一曲东风破\r\r\n[03:05.04]岁月在墙上剥落看见小时候\r\r\n[03:11.59]犹记得那年我们都还很年幼\r\r\n[03:18.23]而如今琴声幽幽我的等候你没听过\r\r\n[03:24.90]谁在用琵琶弹奏一曲东风破\r\r\n[03:31.41]枫叶将故事染色结局我看透\r\r\n[03:37.97]篱笆外的古道我牵着你走过\r\r\n[03:44.60]荒烟蔓草的年头就连分手都\r\r\n[03:51.21]谁在用琵琶弹奏一曲东风破\r\r\n[03:57.80]岁月在墙上剥落看见小时候\r\r\n[04:04.44]犹记得那年我们都还很年幼\r\r\n[04:10.94]而如今琴声幽幽我的等候你没听过\r\r\n[04:17.53]谁在用琵琶弹奏一曲东风破\r\r\n[04:24.04]枫叶将故事染色结局我看透\r\r\n[04:30.64]篱笆外的古道我牵着你走过\r\r\n[04:37.20]荒烟蔓草的年头就连分手都很沉默\r\r\n",
  "singer_id": 1,
  "sname": "东风破",
  "duration": "05:15",
  "url": "/media/周杰伦 - .东风破.d6aeb8d8.mp3",
  "index_show": 1,
  "singerName": "周杰伦",
  "area": "china",
  "id": 3,
  "album_name": "叶惠美",
  "album_art": "/img/7cf439befb9f9df639de56271f10fc11_r.199a7d98.jpg"
}, {
  "song_id": 1,
  "lynic": "[ar:周杰伦]\r\r\n[ti:霍元甲]\r\r\n[00:00.25]周杰伦 - 霍元甲\r\r\n[00:02.03]作词：方文山\r\r\n[00:03.91]作曲：周杰伦\r\r\n[00:05.58]编曲：洪敬尧\r\r\n[00:54.07]嚇 命有几回合 擂台等着\r\r\n[00:57.18]生死状 赢了什么 冷笑着\r\r\n[00:59.57]天下谁的 第一又如何\r\r\n[01:01.96]止干戈 我辈尚武德\r\r\n[01:04.41]我的 拳脚了得 却奈何\r\r\n[01:07.20]徒增虚名一个\r\r\n[01:08.83]江湖难测 谁是强者\r\r\n[01:11.12]谁争一统武林的资格\r\r\n[01:13.62]小城里 岁月流过去\r\r\n[01:18.46]清澈的勇气\r\r\n[01:22.64]洗涤过的回忆\r\r\n[01:25.54]我记得你 骄傲的活下去\r\r\n[01:33.18]霍霍霍霍 霍霍霍霍\r\r\n[01:35.48]霍家拳的套路招式灵活\r\r\n[01:38.12]活活活活 活活活活\r\r\n[01:40.26]活着生命就该完整度过\r\r\n[01:42.96]过过过过 过过过过\r\r\n[01:45.20]过错软弱从来不属于我\r\r\n[01:47.89]我我我我 我我我我\r\r\n[01:50.59]我们精武出手无人能躲\r\r\n[02:02.88]嚇命有几回合 擂台等着\r\r\n[02:05.49]生死状 赢了什么 冷笑着\r\r\n[02:08.09]天下谁的 第一又如何\r\r\n[02:10.53]止干戈 我辈尚武德\r\r\n[02:12.98]我的 拳脚了得 却奈何\r\r\n[02:15.73]徒增虚名一个\r\r\n[02:17.41]江湖难测 谁是强者\r\r\n[02:19.75]谁争一统武林的资格\r\r\n[02:22.15]小城里 岁月流过去\r\r\n[02:27.05]清澈的勇气\r\r\n[02:31.06]洗涤过的回忆\r\r\n[02:34.14]我记得你 骄傲的活下去\r\r\n[02:41.82]霍霍霍霍 霍霍霍霍\r\r\n[02:43.91]霍家拳的套路招式灵活\r\r\n[02:46.71]活活活活 活活活活\r\r\n[02:48.80]活着生命就该完整度过\r\r\n[02:51.55]过过过过 过过过过\r\r\n[02:53.79]过错软弱从来不属于我\r\r\n[02:56.43]我我我我 我我我我\r\r\n[02:58.92]我们精武出手无人能躲\r\r\n[03:30.87]霍霍霍霍 霍霍霍霍\r\r\n[03:33.00]霍家拳的套路招式灵活\r\r\n[03:35.60]活活活活 活活活活\r\r\n[03:37.74]活着生命就该完整度过\r\r\n[03:40.54]过过过过 过过过过\r\r\n[03:42.79]过错软弱从来不属于我\r\r\n[03:45.49]我我我我 我我我我\r\r\n[03:47.63]我们精武出手无人能躲\r\r\n[03:50.63]霍霍霍霍 霍霍霍霍\r\r\n[03:52.62]霍家拳的套路招式灵活\r\r\n[03:55.22]活活活活 活活活活\r\r\n[03:57.62]活着生命就该完整度过\r\r\n[04:00.01]过过过过 过过过过\r\r\n[04:02.46]过错软弱从来不属于我\r\r\n[04:05.15]我我我我 我我我我\r\r\n[04:07.29]我们精武出手无人能躲\r\r\n",
  "singer_id": 1,
  "sname": "霍元甲",
  "duration": "04:38",
  "url": "/media/周杰伦 - .霍元甲.c4de6c55.mp3",
  "index_show": 1,
  "singerName": "周杰伦",
  "area": "china",
  "id": 1,
  "album_name": "霍元甲",
  "album_art": "/img/cimg_ent_2006_1_20_200601200935357b5cb.91fdff00.jpg"
}];
let obj={
  "song_id": 1,
  "lynic": "[ar:周杰伦]\r\r\n[ti:霍元甲]\r\r\n[00:00.25]周杰伦 - 霍元甲\r\r\n[00:02.03]作词：方文山\r\r\n[00:03.91]作曲：周杰伦\r\r\n[00:05.58]编曲：洪敬尧\r\r\n[00:54.07]嚇 命有几回合 擂台等着\r\r\n[00:57.18]生死状 赢了什么 冷笑着\r\r\n[00:59.57]天下谁的 第一又如何\r\r\n[01:01.96]止干戈 我辈尚武德\r\r\n[01:04.41]我的 拳脚了得 却奈何\r\r\n[01:07.20]徒增虚名一个\r\r\n[01:08.83]江湖难测 谁是强者\r\r\n[01:11.12]谁争一统武林的资格\r\r\n[01:13.62]小城里 岁月流过去\r\r\n[01:18.46]清澈的勇气\r\r\n[01:22.64]洗涤过的回忆\r\r\n[01:25.54]我记得你 骄傲的活下去\r\r\n[01:33.18]霍霍霍霍 霍霍霍霍\r\r\n[01:35.48]霍家拳的套路招式灵活\r\r\n[01:38.12]活活活活 活活活活\r\r\n[01:40.26]活着生命就该完整度过\r\r\n[01:42.96]过过过过 过过过过\r\r\n[01:45.20]过错软弱从来不属于我\r\r\n[01:47.89]我我我我 我我我我\r\r\n[01:50.59]我们精武出手无人能躲\r\r\n[02:02.88]嚇命有几回合 擂台等着\r\r\n[02:05.49]生死状 赢了什么 冷笑着\r\r\n[02:08.09]天下谁的 第一又如何\r\r\n[02:10.53]止干戈 我辈尚武德\r\r\n[02:12.98]我的 拳脚了得 却奈何\r\r\n[02:15.73]徒增虚名一个\r\r\n[02:17.41]江湖难测 谁是强者\r\r\n[02:19.75]谁争一统武林的资格\r\r\n[02:22.15]小城里 岁月流过去\r\r\n[02:27.05]清澈的勇气\r\r\n[02:31.06]洗涤过的回忆\r\r\n[02:34.14]我记得你 骄傲的活下去\r\r\n[02:41.82]霍霍霍霍 霍霍霍霍\r\r\n[02:43.91]霍家拳的套路招式灵活\r\r\n[02:46.71]活活活活 活活活活\r\r\n[02:48.80]活着生命就该完整度过\r\r\n[02:51.55]过过过过 过过过过\r\r\n[02:53.79]过错软弱从来不属于我\r\r\n[02:56.43]我我我我 我我我我\r\r\n[02:58.92]我们精武出手无人能躲\r\r\n[03:30.87]霍霍霍霍 霍霍霍霍\r\r\n[03:33.00]霍家拳的套路招式灵活\r\r\n[03:35.60]活活活活 活活活活\r\r\n[03:37.74]活着生命就该完整度过\r\r\n[03:40.54]过过过过 过过过过\r\r\n[03:42.79]过错软弱从来不属于我\r\r\n[03:45.49]我我我我 我我我我\r\r\n[03:47.63]我们精武出手无人能躲\r\r\n[03:50.63]霍霍霍霍 霍霍霍霍\r\r\n[03:52.62]霍家拳的套路招式灵活\r\r\n[03:55.22]活活活活 活活活活\r\r\n[03:57.62]活着生命就该完整度过\r\r\n[04:00.01]过过过过 过过过过\r\r\n[04:02.46]过错软弱从来不属于我\r\r\n[04:05.15]我我我我 我我我我\r\r\n[04:07.29]我们精武出手无人能躲\r\r\n",
  "singer_id": 1,
  "sname": "霍元甲",
  "duration": "04:38",
  "url": "/media/周杰伦 - .霍元甲.c4de6c55.mp3",
  "index_show": 1,
  "singerName": "周杰伦",
  "area": "china",
  "id": 1,
  "album_name": "霍元甲",
  "album_art": "/img/cimg_ent_2006_1_20_200601200935357b5cb.91fdff00.jpg"
}
arr.forEach(item=>{
  delete item.lynic
})
// console.log(arr.map())
// console.log(arr.indexOf(obj))
var currentProfileIndex = (arr|| []).findIndex((profile) => profile.song_id === obj .song_id);
console.log(currentProfileIndex)
